[{"sourceURL": "http://www.realclearpolitics.com/video/2012/08/02/pelosi_i_dont_know_whats_trickling_down_but_its_not_a_pleasant_experience.html", "tags": ["News/Current Events"], "sourceName": "RCP Video", "author": "Sir Napsalot", "excerpt": true, "threadBody": "Pelosi: \"..... It didn't work before. President Bush had one of the worst records of job creation of any President, and again, with such a ditch that he took us in, that it was exacerbated by the financial crisis. It took us to a near depression. We don't want to go there again. And again, I know, the candidates of the millionaires think that that's the only way: Trickle down. Well, I don't know what's trickling down, but it's not a pleasant experience for the middle class. Instead, money is extracted up.\"", "datePosted": "8-2-2012", "title": "Pelosi: \"I Don't Know What's Trickling Down, But It's Not A Pleasant Experience", "_id": "2913879"},
{"replyTo": "!origin", "commentText": "I don't know what else to say.", "threadId": "2913879", "commentNumber": "1", "tagline": ""},
{"replyTo": "Sir Napsalot", "commentText": "Her Depends are leaking, obviously............", "threadId": "2913879", "commentNumber": "2", "tagline": "(Think logically. Act normally.................)"},
{"replyTo": "Sir Napsalot", "commentText": "Why is it always a DITCH metaphor they use?\nWhy don’t they instead charge, “drive us off a BRIDGE”...?\nI think we all know why.", "threadId": "2913879", "commentNumber": "3", "tagline": ""},
{"replyTo": "Sir Napsalot", "commentText": "Pelosi should be tried for treason or put in jail. She is way to gleeful in hurting the American public.", "threadId": "2913879", "commentNumber": "4", "tagline": "(Give me back my conservative vote; then find me a real conservative to vote for)"},
{"replyTo": "Sir Napsalot", "commentText": "The Left wants the Feds to tax the crap out of us and then dole out services. If that’s not the ultimate “trickle down” I don’t know what is.", "threadId": "2913879", "commentNumber": "5", "tagline": "(Stupidity is not a crime, so you're free to go.)"},
{"replyTo": "Sir Napsalot", "commentText": "When it rains on you in San Fransicko, Nancy, make lemonade...", "threadId": "2913879", "commentNumber": "6", "tagline": "(Eric Holder's NAACP rally against the voter ID laws required the press to bring govt issue photo ID.)"},
{"replyTo": "Red Badger", "commentText": "", "threadId": "2913879", "commentNumber": "7", "tagline": "(Sic Semper Tyrannis)"},
{"replyTo": "Sir Napsalot", "commentText": "The money being extracted upwards is called taxes. We know that the Dhims spread bread from Egypt, to to speak, to their Proles; but they distributed even more to their friends in Big Business and in the public employee unions.", "threadId": "2913879", "commentNumber": "8", "tagline": "(Christus rex.)"},
{"replyTo": "Sir Napsalot", "commentText": "LOL...the unemployment rate was well below 5% prior to the Pelosi / Reid / Obama takeover of Congress which began their ascent to power - it was all downhill from there. And even after the financial crisis that had been underway full fledged for months before Bush left office, there were still more people working when he left than when he took office, let alone the number before the Democrats took power. And we can also remember the Democrats along party lines repeatedly blocking any attempt to reign in Fannie Mae and Freddie Mac.\nhttp://www.youtube.com/watch?v=hxMInSfanqg", "threadId": "2913879", "commentNumber": "9", "tagline": ""},
{"replyTo": "freekitty", "commentText": "Nancy’s tweet yesterday was that she prefers KFC over Chik-Fil-A.\nHas anyone asked when the last time she bought chicken from KFC? Last month? Last year? Last decade? Last century?\nShe’s a rich b*witch who doesn’t seem the sort to eat fast food.", "threadId": "2913879", "commentNumber": "10", "tagline": "(Eric Holder's NAACP rally against the voter ID laws required the press to bring govt issue photo ID.)"},
{"replyTo": "Sir Napsalot", "commentText": "&gt;\" President Bush had one of the worst records of job creation of any President\"Gee Nancy, that would explain why there were Help Wanted signs in every window, and lighted billboards seeking help. NOT!\nIt hasn't been that long ago, and there isn't enough foolaide for anyone to swallow that load o carp!", "threadId": "2913879", "commentNumber": "11", "tagline": "(\"Behold, I am against you, O arrogant one,\"         Jeremiah 50:31)"},
{"replyTo": "Sir Napsalot", "commentText": "Just ask Col. West Nancy, I’m sure he has an answer for you!", "threadId": "2913879", "commentNumber": "12", "tagline": ""},
{"replyTo": "Sir Napsalot", "commentText": "I seriously hate this awful woman. I wish nothing but ill will and suffering for her and her ilk.", "threadId": "2913879", "commentNumber": "13", "tagline": "(Democrats are dangerous and evil.  Republicans are useless and useful idiots.)"},
{"replyTo": "a fool in paradise", "commentText": "Proves how stupid she truly is...KFC and CFA has two completely different menus.", "threadId": "2913879", "commentNumber": "14", "tagline": "(Democrats are dangerous and evil.  Republicans are useless and useful idiots.)"},
{"replyTo": "Sir Napsalot", "commentText": "Pelosi: \"I Don't Know What's Trickling Down, But It's Not A Pleasant Experience Nancy, it's the last remaining grey matter in your pathetic liberal skull. Don't worry, soon you won't remember or understand anything at all. Of course, the rest of us will have to put up with unleashed senility.", "threadId": "2913879", "commentNumber": "15", "tagline": ""},
{"replyTo": "Sir Napsalot", "commentText": "", "threadId": "2913879", "commentNumber": "16", "tagline": "(Joe Biden: \"Look, the Taliban per se is not our enemy.\")"},
{"replyTo": "Sir Napsalot", "commentText": "", "threadId": "2913879", "commentNumber": "17", "tagline": "(\"Jiggle the Handle for Barry!\")"},
{"replyTo": "Sir Napsalot", "commentText": "Pelosi: \"I Don't Know What's Trickling Down, But It's Not A Pleasant Experience Hey Nancy, you're losing bladder control, that's what's trickling down.............", "threadId": "2913879", "commentNumber": "18", "tagline": "(The patriots stand guard tonight.)"},
{"replyTo": "Sir Napsalot", "commentText": "Re: President Bush had the worst job creation record Remember this is the Madame House Speaker who said the following on Porkulus (2/4/2009) “Every month that we do not have an economic recovery package 500 million Americans lose their jobs.” So of course in her mind, Bush had the distinction of worst job creation.", "threadId": "2913879", "commentNumber": "19", "tagline": "(Pravda + Useful Idiots = CCCP;  JournOList + Useful Idiots = DopeyChangey!)"},
{"replyTo": "Sir Napsalot", "commentText": "Trickle down is bad only when you build your camp downstream from the Latrine.", "threadId": "2913879", "commentNumber": "20", "tagline": "(TeaPartier  ..... but no longer a Republican)"},
{"replyTo": "Sir Napsalot", "commentText": "The better part of Nancy trickled down her daddy’s leg.......", "threadId": "2913879", "commentNumber": "21", "tagline": "(Tosca, mi fai dimenticare Iddio!!!!!)"},
{"replyTo": "Sir Napsalot", "commentText": "&gt;” President Bush had one of the worst records of job creation of any President”\nUntil O’Bumbler made him look like a job creating titan!", "threadId": "2913879", "commentNumber": "22", "tagline": "(The government is rarely benevolent, often malevolent and never benign!)"},
{"replyTo": "Red Badger", "commentText": "your quick, I had the same thought.", "threadId": "2913879", "commentNumber": "23", "tagline": ""},
{"replyTo": "Sir Napsalot", "commentText": "Did she not get the tweet that Bush hasn’t been in office for four years?", "threadId": "2913879", "commentNumber": "24", "tagline": ""},
{"replyTo": "Sir Napsalot", "commentText": "President Bush had one of the worst records of job creation of any President, and again, with such a ditch that he took us in, that it was exacerbated by the financial crisis. I wish these \"journalists\" reporting on Pelosi's BS would note that (if I remember correctly) Bush averaged around 5.5% unemployment during his first 6 years as President, which in a country of 300+MILLION is considered practically FULL EMPLOYMENT! So, \"technically\" her statement is true that Bush didn't create a great deal of new jobs.HOWEVER, the fact that he MAINTAINED and averaged \"full employment\" until Pelosi and the Dems took over the purse strings should say more about THEIR failures than his! And even if you include the last two years of complete Democrat failure, you will see that he averaged around 6% unemployment - which is MORE THAN RESPECTABLE! I believe America would LOVE to go back to the 2000-2006 unemployment rates, which will NEVER occur with this Administration!", "threadId": "2913879", "commentNumber": "25", "tagline": "(PRAYER: It's the only HOPE for real CHANGE in America!)"},
{"replyTo": "Sir Napsalot", "commentText": "A “glittering jewell of colossal ignorance.” (As El Rushbo might describe her.)", "threadId": "2913879", "commentNumber": "26", "tagline": ""},
{"replyTo": "Sir Napsalot", "commentText": "Yes dear.....we know......have another spoonful of pudding.......don’t lift your gown up to flash the orderlies, it frightens them......yes, we do enjoy your stories about writing on papyrus.....oh, you made a lovely paper weight in your crafts class.....I’m sorry......I thought it was a paper weight.....I didn’t realize it was a bust of Harry Reid......he is kind of a paper weight, though....", "threadId": "2913879", "commentNumber": "27", "tagline": "(\"A crack shot and a good dancer\")"},
{"replyTo": "Sir Napsalot", "commentText": "Pelosi: \"I Don't Know What's Trickling Down, But It's Not A Pleasant Experience If it seems to be all around you, Nancy, it's probably bullshit.Try visiting the other side of the aisle!", "threadId": "2913879", "commentNumber": "28", "tagline": "(Formerly Publius 6961, formerly jennsdad)"}]